#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
module.kv.data.azurerm_client_config.current: Reading...
module.resource_group.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.kv.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]
module.usi.azurerm_user_assigned_identity.msi: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae]
module.kv.azurerm_key_vault.kv: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.KeyVault/vaults/kv-biotrackr-prod-ae]
module.mag.azurerm_monitor_action_group.amg: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/actionGroups/Biotrackr-Action-Group]
module.vnet.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae]
module.law.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.OperationalInsights/workspaces/law-biotrackr-prod-ae]
module.aca_subnet.azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Network/virtualNetworks/vnet-biotrackr-prod-ae/subnets/infrastructure-subnet]
module.budget.azurerm_consumption_budget_resource_group.budget: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Consumption/budgets/Biotrackr-Budget]
module.sb.azurerm_servicebus_namespace.sb: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae]
module.appconfig.azurerm_app_configuration.appconfig: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae]
module.ai.azurerm_application_insights.ai: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.Insights/components/ai-biotrackr-prod-ae]
module.aca_env.azurerm_container_app_environment.env: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae]
module.appconfig_data_reader_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae/providers/Microsoft.Authorization/roleAssignments/707c5afd-62cc-3eb1-9ba1-7cb9a746b2ac]
module.acr_pull_role.azurerm_role_assignment.role: Refreshing state... [id=/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ContainerRegistry/registries/acrbiotrackrprodae/providers/Microsoft.Authorization/roleAssignments/77495baf-63e2-0545-7992-61421922196c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sb_receiver_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Receiver"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sb_sender_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Service Bus Data Sender"
      + scope                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ServiceBus/namespaces/sb-biotrackr-prod-ae"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*